---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExportPatternKey Properties
ExportPatternKey Class See Also Send Feedback
---

The ExportPatternKey type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OriginalFillPatternName | The original FillPattern name. |
|  | OriginalFillPatternType | The original FillPattern type. |

# See Also

ExportPatternKey Class

Autodesk.Revit.DB Namespace